<template>
  <div>    
      <br><v-divider/>
      <h1>หลักสูตร</h1> 
      <h3>สาขาวิชาคอมพิวเตอร์ศึกษา มหาวิทยาลัยราชภัฎบ้านสมเด็จเจ้าพระยา</h3>
      <v-divider/>
    <v-timeline>
      <v-timeline-item v-for="n in items" :key="n.title" color="red lighten-2" large>
        <template v-slot:opposite>            
          <span>{{ n.level }}</span>
        </template>
        <v-card class="elevation-2">
          <v-card-title class="headline">{{ n.title }}</v-card-title>
          <v-card-text>{{ n.detail }}</v-card-text>
        </v-card>
      </v-timeline-item>
    </v-timeline>
     <v-divider/>
  </div>
</template>

<script>
export default {
    data(){
        return{
            items:[
                {
                    title: 'ปริญญาตรี',
                    detail: 'ปริญญาตรี หรือ ปริญญาบัณฑิต เป็นระดับการศึกษาย่อยในการอุดมศึกษา ต่อเนื่องจากชั้นมัธยมศึกษา คำว่า ตรี หมายถึง ชั้นที่สาม',
                    level: 'ปริญญาบัณฑิต '
                },
                {
                    title: 'ปริญญาโท',
                    detail: 'เป็นปริญญาที่ให้แก่บุคคลซึ่งผ่านการศึกษาซึ่งแสดงความชำนาญหรือภาพรวมระดับสูง (high-order overview) ของสาขาการศึกษาหรือแขนงการประกอบวิชาชีพเฉพาะ ในขอบเขตที่ศึกษา ผู้ได้รับปริญญาโทถือว่ามีความรู้สูงในหัวข้อทฤษฎีและประยุกต์กลุ่มชำนัญพิเศษ ทักษะการวิเคราะห์ การประเมินเชิงวิจารณ์หรือการประยุกต์ทางวิชาชีพระดับสูง และความสามารถแก้ไขปัญหาซับซ้อนและคิดอย่างเคร่งครัดและเป็นอิสระ',
                    level: 'ปริญญามหาบัณฑิต'
                },
                {
                    title: 'ปริญญาเอก',
                    detail: 'เป็นปริญญาวิชาการหรือวิชาชีพซึ่งในประเทศส่วนใหญ่ให้ผู้ถือมีคุณสมบัติสอนในระดับมหาวิทยาลัยในสาขาเฉพาะของปริญญานั้น หรือทำงานในวิชาชีพเฉพาะ ในบางประเทศ[ต้องการอ้างอิง] ปริญญาสูงสุดในสาขาหนึ่ง ๆ เรียก ปริญญาสูงสุด (terminal degree)[ต้องการอ้างอิง] คำว่า "doctorate" มาจากภาษาละติน docere หมายถึง "สอน"',
                    level: 'ปริญญาดุษฎีบัณฑิต'
                },
            ]
        }
    }
};
</script>
